package main

import (
	"fmt"
	"sort"
)

func init() {
	for k := range numToUIDmap {
		keys = append(keys, k)
	}
	sort.Ints(keys)
}

func getNextTrackKey(k int) int {
	fmt.Println("getNextTrackKey called")
	for i, value := range keys {
		if value == k {
			if i+1 < len(keys) {
				return keys[i+1]
			} else {
				return keys[0]
			}
		}
	}
	return 0
}

var keys []int
var numToUIDmap = map[int]string{
	// there is no 01 file
	02: "bcd0fc62-f335-467e-9346-c837eaf2ddb6",
	03: "bbacbec1-9f3f-487d-b791-80b96db3f139",
	04: "5b0019f8-77d5-464a-8310-15d99d050a5c",
	05: "39a16994-7a43-482f-9762-829ad998357a",
	06: "e89224e2-50d0-4363-b776-b192fc6246bd",
	07: "8965b310-4f9a-4af0-9382-621c74725c10",
	8:  "630b8171-7f6d-4028-a568-c28ca75f5897",
	9:  "b6485773-035c-46f0-b930-a5ad1e981224",
	10: "827c8580-28a0-4f0c-9a35-3cb8b4eed87f",
	11: "2668142c-1d4f-4ec6-b4bc-42de4c38ca97",
	12: "a9263e0e-9b72-4526-a226-b0a673a88579",
	13: "5cdd829e-7cc0-4c2d-8816-c8c68ff708fa",
	14: "d005e773-d863-4606-a21f-408d9d620083",
	15: "8d971b05-39e7-4967-8ebb-5cce0676340b",
	16: "08effaae-7d0d-4336-acdc-a4bd0699f089",
	17: "25d1594e-52bc-4c23-a6dc-ae50b37ff452",
	18: "9b74557e-108c-4290-b90f-19fc16e08682",
	19: "7e83c3e3-cda3-4686-acae-a0bfe0a0a108",
	20: "d7180c28-680c-448b-a99e-6171aa2d2b0c",
	21: "14de3678-3c4a-48d2-b8cf-3f1f6f2f98a6",
	22: "6afe12c3-af81-401a-8529-c76d9f258d0f",
	23: "e390fa18-8fb1-4d5e-a95b-aa2407934b7b",
	24: "d6066dcb-2742-4d96-b209-e557884adbf0",
	25: "3ce705ee-adc7-43d2-bd2b-58fd448ec18c",
	26: "1a3faed5-49d4-4982-bebc-75d9293e7aa3",
	27: "f309751b-f723-438c-8e77-2991b432a67e",
	28: "1e0edac1-f440-4db2-a3b8-60b1135921dc",
	29: "d8d9b27f-0742-4ea7-b69a-95fb9923d29e",
	30: "3143178e-6bba-4a62-8ee8-20a9b4b2bbdf",
	31: "1adab96b-0216-4709-b60e-0cf331a73c3c",
	32: "47cda7a3-9c36-4cf8-b772-ae00b4587a22",
	33: "24560f96-b872-483b-82cf-b125f02ee2ce",
	34: "4862881c-a12b-4324-a199-ae1bde5ad5ee",
	35: "c7cff7c1-88cb-4daa-9070-9b906ccac342",
	36: "01698d17-292f-4148-bb09-d925f5cbe7a3",
	37: "dc8b8063-d00d-4ac1-bf25-f92e87add78a",
	38: "13951ad0-8e6e-4908-a858-009d0d4b1877",
	39: "6555170e-13fd-4d3b-af75-82e07e10be7b",
	40: "99939e6c-48a6-4926-9248-d9911bb5a0d8",
	41: "b26aa1e1-f607-432d-98ac-08fbb0735521",
	42: "85de9313-bda8-4e2d-92d3-888c1130d5c6",
	43: "cff76870-8837-4254-992d-205db8938eaa",
	44: "d4782bed-7436-418c-ba57-d21b36c9b0a6",
	45: "9a967d8a-4057-41da-969b-f95f02bc9f10",
	46: "afdf0fbd-605b-46f4-992a-bcdf8f8e5874",
	47: "0eda11e8-e00d-4390-8607-56a31dee15c2",
	48: "7e5b07a8-9a6f-43de-99ff-03d10baa990b",
	49: "ebdb2622-8085-4ae7-9fbb-b04f9d5171f6",
	50: "302e7343-368b-45a3-a824-2a53ce0fae9b",
	51: "7011a8de-3304-4bfc-94c8-7bc7a44ae998",
	52: "92661537-b391-485e-8489-639129ea31f3",
	53: "5eb809fd-91fa-4640-b2f9-9535744db963",
	54: "f5404be0-8697-4db6-84e4-0566a898ae7a",
	55: "6f7c2bdb-c37b-45c1-8320-d9a264251de6",
	56: "55e48178-23d9-4ac1-b1fa-f23500a754a5",
	57: "f091ad63-2710-4a98-982b-5d249216ecc5",
	58: "b6e338af-fae4-470d-8f4d-7da37192998e",
	59: "a8296e0f-a79c-4d8c-a903-70956d0d1ddb",
	60: "3e33cb2e-411c-41a7-a72f-ee228ac5ebf1",
	61: "62f51a87-a5ac-4b51-96ba-fcb7ac829bfe",
	62: "2bc18aa7-d8cb-4916-adbb-0e026442a0e3",
	63: "6e77d94a-e8d1-4631-b08e-a9b580b692cc",
	65: "4a8cfaf6-d98f-4a33-a735-af4d0e830841",
	66: "4b52bc8b-b994-4356-aa28-a6919b6e55c8",
	67: "75c42d43-43ef-4914-b082-a94d4497ef4d",
	68: "d807dfa1-f208-4171-b56c-a5ac98ff3267",
	69: "a4eec251-1b18-4dab-a4ae-98a4bb1fe093",
	70: "b728d48e-4672-4ccd-91c8-101ee4ab0727",
	71: "d4cd31d2-91ad-490a-ac57-66ef00459863",
	72: "0d4cbd39-7c28-43f2-8069-29859d109706",
	73: "d7439151-27da-4264-ab8c-db6232e9c863",
	74: "8e11ee64-8d75-49aa-b85d-682fe74e9156",
	75: "36feb95f-b200-4f4e-a271-cc7997324ff6",
	76: "1503fe54-e4bd-42da-bff0-0c48b8460b61",
	77: "36f1bc16-770d-4ecb-a9bd-8bc0c69e2615",
	78: "5c33a108-7192-4d24-9ba5-02901c1845ea",
	79: "e160975a-4b50-465a-8cc4-a6ccd0e545b6",
	80: "5821e16a-51dc-447c-9a0d-f39e861ad3ea",
	81: "c10cb7ff-70b4-4b2a-b8c5-9db5a78dc100",
	82: "324d3bc9-7c6b-4d84-b451-e20628cacd18",
	83: "7b8a46bf-5aa0-4a9d-b40b-c870554056f3",
	84: "dd8b0d5d-659a-4eb6-8330-5acfe2758d3f",
	85: "c6acaab8-734e-451c-8e1e-70e1cc30b9f6",
	86: "ac17a6fb-df93-47a1-9331-935aa127f770",
	87: "2a3a560a-6575-4450-8400-cb6b9e34c0a2",
}

var sectionPageToFileNum = map[string]int{
	// Section 2. Hello!
	"раздел один упражнение один":   2,
	"раздел один упражнение два":    3,
	"раздел один упражнение три":    4,
	"раздел один упражнение четыре": 5,
	"раздел один упражнение шесть":  6,
	"раздел один упражнение семь":   7,
	"раздел один упражнение восемь": 8,
	"раздел один упражнение девять": 9,
	// ...

	// Section 3. This is Nora
	// Page 27
	"раздел три":                 27,
	"раздел три упражнение один": 27,
	"раздел три упражнение два":  27,
	"раздел три упражнение три":  28,
	"раздел три упражнение пять": 29,

	// _30_
	"раздел три упражнение одинадцать": 30,

	// Section 4.
	"раздел четыре упражнение три": 35,
}

var pageAndExerciseToFileNum = map[string]int{
	// page 6
	"страница шесть упражнение один": 2,
	"страница шесть упражнение два":  3,
	// page 7
	"страница семь упражнение три":    4,
	"страница семь упражнение четыре": 5,
	// page 8
	"страница восемь упражнение шесть": 6,
	"страница восемь упражнение семь":  7,
	// page 9
	"страница девять упражнение восемь": 8,
	"страница девять упражнение девять": 9,
	// Page 28
	"страница двадцать восемь упражнение три":  28,
	"страница двадцать восемь упражнение пять": 28,
}

var sectionAndExerciseToFileNum = map[string]int{
	//"А":                     02,
	"раздел 1 упражнение 2":       03,
	"раздел 1 упражнение 3":       04,
	"раздел 1 упражнение 4":       05,
	"раздел 1 упражнение 6":       06,
	"раздел 1 упражнение 7":       7,
	"раздел 1 упражнение 8":       8,
	"раздел 1 упражнение 9":       9,
	"раздел 1 упражнение 11":      10,
	"раздел 1 упражнение 13":      11,
	"раздел 1 упражнение 14":      12,
	"раздел 1 упражнение 15":      13,
	"раздел 1 упражнение 16":      14,
	"раздел 1 упражнение 18":      15,
	"раздел 1 упражнение 19":      16,
	"раздел 1 упражнение 20":      17,
	"раздел 1 английский алфавит": 18,
	"английский алфавит":          18,
	//"а": 19,
	"раздел 2 хеллоу":        20,
	"раздел 2 упражнение 3":  21,
	"раздел 2 упражнение 5":  22,
	"раздел 2 упражнение 7":  23,
	"раздел 2 упражнение 11": 24,
	//"": 25,
	//"а": 26,
	//"а": 27,
	//"": 28,
	"раздел 3 упражнение 5":  29,
	"раздел 3 упражнение 1":  30,
	"раздел 3 упражнение 12": 31,
	"раздел 3 упражнение 13": 32,
	//"": 33,
	//"а": 34,
	"раздел 4 упражнение 3":  35,
	"раздел 4 упражнение 5":  36,
	"раздел 4 упражнение 11": 37,
	"раздел 4 упражнение 12": 38,
	//"а": 39,
	//"а": 40,
	"раздел 5 упражнение 3":  41,
	"раздел 5 упражнение 5":  42,
	"раздел 5 упражнение 10": 43,
	"раздел 5 упражнение 12": 44,
	"раздел 5 упражнение 13": 45,
	"раздел 5 упражнение 14": 46, // one track to both exercises
	"раздел 5 упражнение 15": 46,
	//"а": 47,
	//"а": 48,
	"раздел 6 упражнение 3":  49,
	"раздел 6 упражнение 5":  50,
	"раздел 6 упражнение 9":  51,
	"раздел 6 упражнение 10": 52, // one track to both exercises
	"раздел 6 упражнение 11": 52,
	"раздел 6 упражнение 12": 53,
	//"": 54,
	//"а": 55,
	"раздел 7 упражнение 3":  56,
	"раздел 7 упражнение 5":  57,
	"раздел 7 упражнение 10": 58,
	"раздел 7 упражнение 11": 59,
	"раздел 7 упражнение 15": 60,
	//"а":                      61,
	//"":                       62,
	"раздел 8 упражнение 3":  63,
	"раздел 8 упражнение 5":  64,
	"раздел 8 упражнение 11": 65,
	"раздел 8 упражнение 12": 66, // one track to both exercises
	"раздел 8 упражнение 13": 66,
	//"":                       67,
	//"":                       68,
	"раздел 9 упражнение 3":  69,
	"раздел 9 упражнение 5":  70,
	"раздел 9 упражнение 11": 71,
	"раздел 9 упражнение 12": 72, // one track to both exercises
	"раздел 9 упражнение 13": 72,
	//"":                         73,
	//"":                         74,
	"раздел 10 упражнение 3":  75,
	"раздел 10 упражнение 5":  76,
	"раздел 10 упражнение 11": 77,
	//"а":                        78,
	"раздел 10 упражнение 13": 79,
	"раздел 10 упражнение 14": 80,
	//"":                         81,
	//"а":                        82,
	"раздел 11 упражнение 3":  83,
	"раздел 11 упражнение 5":  84,
	"раздел 11 упражнение 9":  85, // one track to both exercises
	"раздел 11 упражнение 10": 85,
	"раздел 11 упражнение 14": 86,
	//"":                         87,
}
